package day07;

public class OddEvenGameEx2 {

	public static void main(String[] args) {
		/*다음 기능을 가진 프로그램을 작성하세요 메서드 이용
		 * 메뉴
		 * 1.새 게임
		 * 2.결과조회
		 * 3.프로그램 종료
		 * 메뉴 선택 : 1
		 * ----------------
		 * 선택(홀:1,짝:0):1
		 * 3 홀 입니다. 
		 * 성공
		 * ------------------
		 * 메뉴
		 * 1.새 게임
		 * 2.결과 조회
		 * 3.프로그램 종료
		 * 메뉴 선택 :2
		 * --------------
		 * 결과 :1승 0패
		 * --------------
		 * 메뉴
		 * 1.새 게임
		 * 2.결과 조회
		 * 3.프로그램 종료
		 * 메뉴 선택 :3
		 * --------------
		 * 프로그램 종료
		 * */

	}
	/* 기능 : 정수가 주어
	 * 매개변수 :
	 * 리턴타입 :
	 * 메서드명 :
	 * */
	public static 반환타입 함수명(매개변수들) {
		구현;
		return 값;//반환타입이 있는경우
	}
	
	
}
